Revit 2027 API
FormattedText.SetBoldStatus Method
Overload List
Name | Description
SetBoldStatus(Boolean) |  Sets the characters in the entire text to be bold or not bold.
SetBoldStatus(TextRange, Boolean) |  Sets the characters in a given text range to be bold or not bold.
Top
See Also
Reference
FormattedText Class
Autodesk.Revit.DB Namespace